#### BuiltInFailures.KeynoteFailures Members

---

|  |
| --- |
| BuiltInFailures KeynoteFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures KeynoteFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | MissKeynoteParameter | No Keynote Parameter.\nTo resolve, select key value parameter in keynoting system. |
| Public property Static member | MissKeynotingSystem | No Keynoting System associated with Tag Family.\nTo resolve, select keynoting system for the tag family. |
| Public property Static member | NotAssociatedKeynoteParameter | Current tag keynoting system uses key value parameter that is not associated with this element category.\nTo resolve, associate parameter with category or change keynoting system. |

# See Also

BuiltInFailures KeynoteFailures Class

Autodesk.Revit.DB Namespace